
#ifndef __PIT_H__
#define __PIT_H__


//==============================INCLUDE==============================//
#include "common.h"

//==============================TYPEDEF==============================//
typedef enum _PIT_x_
{
    PIT0 = 0,
    PIT1 = 1,
} PIT_x_TypeDef;


//==============================FUNCTION==============================//

//======================================================================
//函数名称：PIT_Init()
//函数功能：初始化PIT一个模块
//输    入：PIT_x_TypeDef           PIT_x               需初始化的PIT模块
//          unsigned short          pitus               需周期定时的us级数
//输    出：无
//返    回： 0      :   成功
//          -1      :   失败
//======================================================================
int PIT_Init(PIT_x_TypeDef PIT_x, unsigned long pitus);

//======================================================================
//函数名称：PIT_Enable()
//函数功能：开启PIT一个模块
//输    入：PIT_x_TypeDef           PIT_x               需初始化的PIT模块
//          ISR_CALLBACK            pit_isr;            中断调用函数
//输    出：无
//返    回：无
//======================================================================
void PIT_Enable(PIT_x_TypeDef PIT_x, ISR_CALLBACK pit_isr);

//======================================================================
//函数名称：PIT_Disable()
//函数功能：关闭PIT一个模块
//输    入：PIT_x_TypeDef           PIT_x               需初始化的PIT模块
//输    出：无
//返    回：无
//======================================================================
void PIT_Disable(PIT_x_TypeDef PIT_x);

//======================================================================
//函数名称：PIT_IRQHandler()
//函数功能：PIT模块中断服务统一入口(禁止调用)
//输    入：无
//输    出：无
//返    回：无
//======================================================================
void PIT_IRQHandler(void);

/*
#undef  VECTOR_038
#define VECTOR_038  PIT_IRQHandler
*/


//==============================END==============================//

#endif /* __PIT_H__ */

